src/Reports/АнализОбеспеченностиМПЗ/АнализОбеспеченностиМПЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>АнализОбеспеченностиМПЗ</name>
</mdclass:Report>

src/AccumulationRegisters/ЗаказыНаПроизводство/ЗаказыНаПроизводство.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЗаказыНаПроизводство</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Продукция</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.Материалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.ЗаказНаПроизводство</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/AccumulationRegisters/ЗаказыПоставщикам/ЗаказыПоставщикам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЗаказыПоставщикам</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаИсполнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>МПЗ</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.Материалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаказПоставщику</name>
    <type>
      <types>DocumentRef.ЗаказПоставщику</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Documents/МаршрутнаяКарта/МаршрутнаяКарта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>МаршрутнаяКарта</name>
  <basedOn>Document.ЗаказНаПроизводство</basedOn>
  <basedOn>Document.РемонтнаяКарта</basedOn>
  <basedOn>Document.СписаниеМПЗПрочее</basedOn>
  <registerRecords>AccumulationRegister.МестаХранения</registerRecords>
  <registerRecords>AccumulationRegister.ЗаказыНаПроизводство</registerRecords>
  <registerRecords>AccumulationRegister.ПланыВыпуска</registerRecords>
  <registerRecords>AccumulationRegister.ПередачиВПроизводство</registerRecords>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.РемонтнаяКарта</types>
      <types>DocumentRef.СписаниеМПЗПрочее</types>
      <types>DocumentRef.ЗаявкаОтПокупателя</types>
      <types>DocumentRef.МаршрутнаяКарта</types>
      <types>DocumentRef.ЗаказНаПроизводство</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерОчереди</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Линейка</name>
    <type>
      <types>CatalogRef.Линейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛинейкаИнициатор</name>
    <type>
      <types>CatalogRef.Линейки</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХраненияПотребитель</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЯчейки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Счёт</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ремонт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаОстановки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПредполагаемогоОкончанияОстановки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияОстановки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИнициаторОстановки</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>МПЗОстановки</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.Материалы</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОстановки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СтандартныйКомментарий</name>
    <type>
      <types>CatalogRef.СтандартныеКомментарии</types>
    </type>
  </attributes>
  <attributes>
    <name>Выгружено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Аналоги</name>
    <attributes>
      <name>Спецификация</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>НормаРасходов</name>
      <type>
        <types>CatalogRef.НормыРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>АналогНормыРасходов</name>
      <type>
        <types>CatalogRef.АналогиНормРасходов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТехОперации</name>
    <attributes>
      <name>ТехОперация</name>
      <type>
        <types>CatalogRef.ТехОперации</types>
      </type>
    </attributes>
    <attributes>
      <name>Спецификация</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Остановки</name>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончанияПредполагаемая</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Причина</name>
      <type>
        <types>CatalogRef.ПричиныОстановок</types>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МПЗ</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Инициатор</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
        <types>CatalogRef.Подразделения</types>
      </type>
    </attributes>
    <attributes>
      <name>РабочееМесто</name>
      <type>
        <types>CatalogRef.РабочиеМестаЛинеек</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Reports/АнализОбеспеченностиМПЗ/Forms/ФормаОтчета/Module.bsl
&НаСервере
Функция ПолучитьНезапущенныеИзделия()
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПроизводственноеЗадание.Изделие КАК Изделие,
	|	СУММА(ПроизводственноеЗадание.Количество) КАК Количество
	|ИЗ
	|	Документ.ПроизводственноеЗадание КАК ПроизводственноеЗадание
	|ГДЕ
	|	ПроизводственноеЗадание.ДатаЗапуска = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПроизводственноеЗадание.Изделие";
Возврат(Запрос.Выполнить().Выгрузить());	
КонецФункции
                   
&НаСервере
Функция ПолучитьОстаткиПоЗНП()
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказыНаПроизводствоОстатки.Продукция КАК Продукция,
	|	ЗаказыНаПроизводствоОстатки.Документ КАК Документ,
	|	ЗаказыНаПроизводствоОстатки.КоличествоОстаток КАК КоличествоОстаток
	|ИЗ
	|	РегистрНакопления.ЗаказыНаПроизводство.Остатки КАК ЗаказыНаПроизводствоОстатки
	|ГДЕ
	|	ЗаказыНаПроизводствоОстатки.Документ.Закрыт = ЛОЖЬ
	|	И ЗаказыНаПроизводствоОстатки.Документ.Проведен = ИСТИНА";
Возврат(Запрос.Выполнить().Выгрузить());
КонецФункции 

&НаСервере
Функция ПолучитьСозданныеИзделия()
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	МаршрутнаяКарта.Номенклатура КАК Номенклатура,
	|	МаршрутнаяКарта.Количество КАК Количество,
	|	МаршрутнаяКарта.ДокументОснование КАК ЗНП
	|ИЗ
	|	Документ.МаршрутнаяКарта КАК МаршрутнаяКарта
	|ГДЕ
	|	МаршрутнаяКарта.ДокументОснование.Закрыт = ЛОЖЬ
	|	И МаршрутнаяКарта.Статус <> 3";
Возврат(Запрос.Выполнить().Выгрузить());
КонецФункции 

&НаСервере
Процедура ВхождениеВСпецификацииКонечные(Элемент,Норма,СписокИзделий)
спНомен = ОбщийМодульВызовСервера.ПолучитьСписокВхожденийСНормой(Элемент,ТекущаяДата());
	Для каждого Строка Из спНомен Цикл
		Если Не Строка.Значение.Товар.Пустая() Тогда
			Если СписокИзделий.НайтиПоЗначению(Строка.Значение) = Неопределено Тогда
			СписокИзделий.Добавить(Строка.Значение,Норма*Число(Строка.Представление));
			КонецЕсли;	
		КонецЕсли;
	ВхождениеВСпецификацииКонечные(Строка.Значение,Норма*Число(Строка.Представление),СписокИзделий);
	КонецЦикла;
КонецПроцедуры
                    
&НаСервере
Функция ПолучитьОстатокПоЗаказамПоставщикам(МПЗ)
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказыПоставщикамОстатки.МПЗ КАК МПЗ,
	|	ЗаказыПоставщикамОстатки.КоличествоОстаток КАК КоличествоОстаток
	|ИЗ
	|	РегистрНакопления.ЗаказыПоставщикам.Остатки(&НаДату, ) КАК ЗаказыПоставщикамОстатки
	|ГДЕ
	|	ЗаказыПоставщикамОстатки.МПЗ = &МПЗ
	|ИТОГИ
	|	СУММА(КоличествоОстаток)
	|ПО
	|	МПЗ"; 
Запрос.УстановитьПараметр("НаДату", ТекущаяДата());
Запрос.УстановитьПараметр("МПЗ", МПЗ);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаЗаказыПоставщикамМПЗ = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаЗаказыПоставщикамМПЗ.Следующий() Цикл
	Возврат(ВыборкаЗаказыПоставщикамМПЗ.КоличествоОстаток);	
	КонецЦикла;
Возврат(0);
КонецФункции

&НаСервере
Функция ПолучитьСводныйОстатокПФПоМестамХранения(спПФ)
Запрос = Новый Запрос;
МВТ = Новый МенеджерВременныхТаблиц;              

Запрос.МенеджерВременныхТаблиц = МВТ;
Запрос.Текст = 
	"ВЫБРАТЬ
	|	СУММА(МестаХраненияОстатки.КоличествоОстаток) КАК КоличествоОстаток,
	|	МестаХраненияОстатки.МПЗ КАК МПЗ
	|ПОМЕСТИТЬ МХО
	|ИЗ
	|	РегистрНакопления.МестаХранения.Остатки(
	|			&НаДату,
	|			МестоХранения В ИЕРАРХИИ (&СписокМестХранения)
	|				И МПЗ В (&спПФ)) КАК МестаХраненияОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	МестаХраненияОстатки.МПЗ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	МПЗ";
Запрос.УстановитьПараметр("НаДату", ТекущаяДата()); 
Запрос.УстановитьПараметр("СписокМестХранения", СписокМестХранения); 
Запрос.УстановитьПараметр("спПФ", спПФ); 
Запрос.Выполнить();
Запрос.Текст="ВЫБРАТЬ * из МХО";
Возврат(Запрос.Выполнить().Выгрузить());
КонецФункции
   
&НаСервере
Процедура СформироватьНаСервере()
ТабДок.Очистить();
ТЗ = Новый ТаблицаЗначений;

СписокИзделий = Новый СписокЗначений;

ОбъектЗн = РеквизитФормыВЗначение("Отчет");
Макет = ОбъектЗн.ПолучитьМакет("Макет");

ОблШапка = Макет.ПолучитьОбласть("Шапка");
ОблМПЗ = Макет.ПолучитьОбласть("МПЗ");
ОблИтогоМПЗ = Макет.ПолучитьОбласть("ИтогоМПЗ");
ОблПФ = Макет.ПолучитьОбласть("ПФ");
ОблИтогоПФ = Макет.ПолучитьОбласть("ИтогоПФ");
ОблИзделие = Макет.ПолучитьОбласть("Изделие");
ОблКонец = Макет.ПолучитьОбласть("Конец");

ОблШапка.Параметры.НаДату = ТекущаяДата();
ТабДок.Вывести(ОблШапка);

ОблМПЗ.Параметры.НаименованиеМПЗ = СокрЛП(МПЗ.Наименование);
ОблМПЗ.Параметры.МПЗ = МПЗ;
ТабДок.Вывести(ОблМПЗ);
ТабДок.НачатьГруппуСтрок("МПЗ");
спПФ = ОбщийМодульВызовСервера.ПолучитьСписокВхожденийСНормой(МПЗ,ТекущаяДата());
ТаблицаМХО = ПолучитьСводныйОстатокПФПоМестамХранения(спПФ);
ТаблицаНезапущенных = ПолучитьНезапущенныеИзделия(); 
ТаблицаНезапущенных.Индексы.Добавить("Изделие");
ТаблицаНесозданных = ПолучитьОстаткиПоЗНП();
ТаблицаНесозданных.Индексы.Добавить("Продукция");
ТаблицаСозданных = ПолучитьСозданныеИзделия();
ТаблицаСозданных.Индексы.Добавить("Номенклатура,ЗНП");

КоличествоНеобеспеченных = 0;
	Для каждого ПФ Из спПФ Цикл
	флВыведен = Ложь;	
	СписокИзделий.Очистить(); 
	ВхождениеВСпецификацииКонечные(ПФ.Значение,1,СписокИзделий);
	Выборка = ТаблицаМХО.Найти(ПФ.Значение,"МПЗ");
		Если Выборка <> Неопределено Тогда
		КоличествоНаСкладах = Выборка.КоличествоОстаток;
		Иначе	
		КоличествоНаСкладах = 0;
		КонецЕсли;
	КоличествоНезапущенныхИтого = 0;
	КоличествоНесозданныхИтого = 0; 
		Для каждого Изд Из СписокИзделий Цикл
		Выборка = ТаблицаНезапущенных.Найти(Изд.Значение,"Изделие");
			Если Выборка <> Неопределено Тогда
			КоличествоНезапущенных = Выборка.Количество;
			Иначе	
			КоличествоНезапущенных = 0;
			КонецЕсли;  
		КоличествоНесозданных = 0;
		Выборка = ТаблицаНесозданных.НайтиСтроки(Новый Структура("Продукция",Изд.Значение));
			Для к = 0 По Выборка.ВГраница() Цикл
			КоличествоНесозданных = КоличествоНесозданных + Выборка[к].КоличествоОстаток;
			ВыборкаМТК = ТаблицаСозданных.НайтиСтроки(Новый Структура("Номенклатура,ЗНП",Изд.Значение,Выборка[к].Документ));
				Для л = 0 По ВыборкаМТК.ВГраница() Цикл
				КоличествоНесозданных = КоличествоНесозданных - ВыборкаМТК[л].Количество;
				КонецЦикла;		
			КонецЦикла;
				Если (КоличествоНезапущенных + КоличествоНесозданных) > 0 Тогда
					Если Не флВыведен Тогда
					ОблПФ.Параметры.НаименованиеПФ = СокрЛП(ПФ.Значение.Наименование);
					ОблПФ.Параметры.ПФ = ПФ.Значение; 
					ОблПФ.Параметры.Норма = Число(ПФ.Представление);
					ТабДок.Вывести(ОблПФ);		
					ТабДок.НачатьГруппуСтрок("ПФ");
					флВыведен = Истина;
					КонецЕсли;				       
				ОблИзделие.Параметры.НаименованиеИзделие = СокрЛП(Изд.Значение.Наименование);
				ОблИзделие.Параметры.Изделие = Изд.Значение;
				ОблИзделие.Параметры.Линейка = Изд.Значение.Линейка; 
				ОблИзделие.Параметры.Норма = Число(Изд.Представление);			
				ОблИзделие.Параметры.КоличествоНезапущенных = КоличествоНезапущенных;
				ОблИзделие.Параметры.КоличествоНесозданных = КоличествоНесозданных;
				ТабДок.Вывести(ОблИзделие);
				КоличествоНезапущенныхИтого = КоличествоНезапущенныхИтого + КоличествоНезапущенных*Число(Изд.Представление);
				КоличествоНесозданныхИтого = КоличествоНесозданныхИтого + КоличествоНесозданных*Число(Изд.Представление);
				КонецЕсли;
		КонецЦикла;
			Если флВыведен Тогда
			ТабДок.ЗакончитьГруппуСтрок();
			ОблИтогоПФ.Параметры.КоличествоНаСкладах = КоличествоНаСкладах;
			ОблИтогоПФ.Параметры.КоличествоНезапущенных = КоличествоНезапущенныхИтого;
			ОблИтогоПФ.Параметры.КоличествоНесозданных = КоличествоНесозданныхИтого;
			ОблИтогоПФ.Параметры.Обеспеченность = ОблИтогоПФ.Параметры.КоличествоНаСкладах - КоличествоНезапущенныхИтого - КоличествоНесозданныхИтого;
				Если ОблИтогоПФ.Параметры.Обеспеченность < 0 Тогда
				КоличествоНеобеспеченных = КоличествоНеобеспеченных + ОблИтогоПФ.Параметры.Обеспеченность*Число(ПФ.Представление);
				КонецЕсли;
			ТабДок.Вывести(ОблИтогоПФ);
			КонецЕсли;
	КонецЦикла;
ТабДок.ЗакончитьГруппуСтрок();
ОблИтогоМПЗ.Параметры.КоличествоНаСкладах = ОбщийМодульВызовСервера.ПолучитьСводныйОстатокПоМестамХранения(СписокМестХранения,МПЗ);
ОблИтогоМПЗ.Параметры.КоличествоВПути = ПолучитьОстатокПоЗаказамПоставщикам(МПЗ);
ОблИтогоМПЗ.Параметры.Обеспеченность = ОблИтогоМПЗ.Параметры.КоличествоНаСкладах + ОблИтогоМПЗ.Параметры.КоличествоВПути + КоличествоНеобеспеченных;
ТабДок.Вывести(ОблИтогоМПЗ);
ТабДок.Вывести(ОблКонец);
ТабДок.ФиксацияСверху = 2;
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	Если ЭтаФорма.ПроверитьЗаполнение() Тогда
	НачалоЗамера = ТекущаяУниверсальнаяДатаВМиллисекундах(); 
	Состояние("Обработка...",,"Формирование таблицы отчёта...");
	СформироватьНаСервере();
	ОкончаниеЗамера = ТекущаяУниверсальнаяДатаВМиллисекундах();
	Элементы.ВремяФормирования.Заголовок = ""+Окр((ОкончаниеЗамера - НачалоЗамера)/1000/60,1)+" мин.";
	КонецЕсли;
КонецПроцедуры
